Revit 2027 API
ParameterTypeId.SteelElemWeldMainType Property
 "Main Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldMainType { get; }
Public Shared ReadOnly Property SteelElemWeldMainType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldMainType {
	ForgeTypeId^ get ();
}
static member SteelElemWeldMainType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace